#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-aNzAQoPuw71iF67g

Waiting for the plan to start...

Terraform v1.0.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.repos_cdktfproviderlocal_repo_4D7B21AD: Refreshing state... [id=cdktf-provider-local]
github_repository.repos_cdktfprovidergoogle_repo_3D7769E0: Refreshing state... [id=cdktf-provider-google]
github_repository.repos_cdktfproviderkubernetes_repo_D69C3A79: Refreshing state... [id=cdktf-provider-kubernetes]
github_repository.repos_cdktfprovidernull_repo_8A692B1D: Refreshing state... [id=cdktf-provider-null]
github_repository.repos_cdktfproviderproject_repo_014C3CE2: Refreshing state... [id=cdktf-provider-project]
github_repository.repos_cdktfproviderarchive_repo_F28A4A49: Refreshing state... [id=cdktf-provider-archive]
github_repository.repos_cdktfproviderazurerm_repo_19E06DC3: Refreshing state... [id=cdktf-provider-azurerm]
github_repository.repos_cdktfprovidercloudinit_repo_4E4D12FF: Refreshing state... [id=cdktf-provider-cloudinit]
github_repository.repos_cdktfproviderdatadog_repo_3C8DEE00: Refreshing state... [id=cdktf-provider-datadog]
github_repository.repos_cdktfproviderdocker_repo_45A47809: Refreshing state... [id=cdktf-provider-docker]
github_repository.repos_cdktfproviderazuread_repo_A398ECE6: Refreshing state... [id=cdktf-provider-azuread]
github_repository.repos_cdktfproviderexternal_repo_2177D259: Refreshing state... [id=cdktf-provider-external]
github_repository.repos_cdktfproviderrandom_repo_448077DE: Refreshing state... [id=cdktf-provider-random]
github_repository.repos_cdktfproviderpagerduty_repo_0AF36FE3: Refreshing state... [id=cdktf-provider-pagerduty]
github_repository.repos_cdktfrepositorymanager_repo_9D19EE52: Refreshing state... [id=cdktf-repository-manager]
github_repository.repos_cdktfprovideraws_repo_55F46B23: Refreshing state... [id=cdktf-provider-aws]
github_repository.repos_cdktfprovidergithub_repo_66B8E54A: Refreshing state... [id=cdktf-provider-github]
github_repository.repos_cdktfprovidertls_repo_E6EAEEBE: Refreshing state... [id=cdktf-provider-tls]
github_repository.repos_cdktfproviderhelm_repo_E5C9B6C8: Refreshing state... [id=cdktf-provider-helm]
github_repository.repos_cdktfproviderpostgresql_repo_9CD37AD7: Refreshing state... [id=cdktf-provider-postgresql]
github_actions_secret.repos_cdktfproviderproject_repo_secretnpmtoken_BB8123FF: Refreshing state... [id=cdktf-provider-project:NPM_TOKEN]
github_issue_label.repos_cdktfproviderproject_automergelabel_314CBFA5: Refreshing state... [id=cdktf-provider-project:automerge]
github_actions_secret.repos_cdktfproviderlocal_repo_secretmavenstagingprofileid_BE854BB2: Refreshing state... [id=cdktf-provider-local:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderlocal_repo_secretnpmtoken_2DDEB7C4: Refreshing state... [id=cdktf-provider-local:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderlocal_repo_secretmavengpgprivatekeypassphrase_FA1FEC93: Refreshing state... [id=cdktf-provider-local:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderlocal_repo_secretmavenpassword_780EDEC8: Refreshing state... [id=cdktf-provider-local:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderlocal_repo_secretmavenusername_927EABFE: Refreshing state... [id=cdktf-provider-local:MAVEN_USERNAME]
github_branch_protection.repos_cdktfproviderlocal_mainprotection_2BB09763: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA2OTg=]
github_actions_secret.repos_cdktfproviderlocal_repo_secretghtoken_DBC651EC: Refreshing state... [id=cdktf-provider-local:GH_TOKEN]
github_actions_secret.repos_cdktfproviderlocal_repo_secrettwineusername_CC22F1DB: Refreshing state... [id=cdktf-provider-local:TWINE_USERNAME]
github_actions_secret.repos_cdktfproviderlocal_repo_secretnugetapikey_2F71182F: Refreshing state... [id=cdktf-provider-local:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderlocal_repo_secretmavengpgprivatekey_A6426E42: Refreshing state... [id=cdktf-provider-local:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderlocal_repo_secrettwinepassword_8AA06A3E: Refreshing state... [id=cdktf-provider-local:TWINE_PASSWORD]
github_issue_label.repos_cdktfproviderlocal_automergelabel_C0E7761B: Refreshing state... [id=cdktf-provider-local:automerge]
github_actions_secret.repos_cdktfproviderarchive_repo_secretghtoken_A241E972: Refreshing state... [id=cdktf-provider-archive:GH_TOKEN]
github_actions_secret.repos_cdktfproviderarchive_repo_secretmavenstagingprofileid_CF2B69CA: Refreshing state... [id=cdktf-provider-archive:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderarchive_repo_secretnugetapikey_B91B53D7: Refreshing state... [id=cdktf-provider-archive:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderarchive_repo_secrettwineusername_C03FAF4F: Refreshing state... [id=cdktf-provider-archive:TWINE_USERNAME]
github_actions_secret.repos_cdktfproviderarchive_repo_secretmavengpgprivatekey_4C753FBA: Refreshing state... [id=cdktf-provider-archive:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderarchive_repo_secretmavenusername_227B10FC: Refreshing state... [id=cdktf-provider-archive:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderarchive_repo_secretnpmtoken_B291E237: Refreshing state... [id=cdktf-provider-archive:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderarchive_repo_secrettwinepassword_3B832C1B: Refreshing state... [id=cdktf-provider-archive:TWINE_PASSWORD]
github_actions_secret.repos_cdktfproviderarchive_repo_secretmavengpgprivatekeypassphrase_5B346E0B: Refreshing state... [id=cdktf-provider-archive:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_branch_protection.repos_cdktfproviderarchive_mainprotection_71039C33: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA2OTU=]
github_issue_label.repos_cdktfproviderarchive_automergelabel_869BB088: Refreshing state... [id=cdktf-provider-archive:automerge]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretmavengpgprivatekey_A85C1B05: Refreshing state... [id=cdktf-provider-google:MAVEN_GPG_PRIVATE_KEY]
github_issue_label.repos_cdktfprovidergoogle_automergelabel_359F63C4: Refreshing state... [id=cdktf-provider-google:automerge]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretmavengpgprivatekeypassphrase_920DD1ED: Refreshing state... [id=cdktf-provider-google:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretnpmtoken_679FDFB7: Refreshing state... [id=cdktf-provider-google:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderarchive_repo_secretmavenpassword_C2AECDEC: Refreshing state... [id=cdktf-provider-archive:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfprovidergoogle_repo_secrettwinepassword_46DD5755: Refreshing state... [id=cdktf-provider-google:TWINE_PASSWORD]
github_actions_secret.repos_cdktfprovidergoogle_repo_secrettwineusername_8F52E212: Refreshing state... [id=cdktf-provider-google:TWINE_USERNAME]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretghtoken_E4A89BC8: Refreshing state... [id=cdktf-provider-google:GH_TOKEN]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretmavenpassword_E3D574C6: Refreshing state... [id=cdktf-provider-google:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretmavenusername_949E0421: Refreshing state... [id=cdktf-provider-google:MAVEN_USERNAME]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretmavenstagingprofileid_155BE188: Refreshing state... [id=cdktf-provider-google:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretnugetapikey_1DE39322: Refreshing state... [id=cdktf-provider-google:NUGET_API_KEY]
github_branch_protection.repos_cdktfprovidergoogle_mainprotection_2D089CC1: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODA=]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretnpmtoken_7FE4E99F: Refreshing state... [id=cdktf-provider-kubernetes:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretmavenpassword_41DAD2C0: Refreshing state... [id=cdktf-provider-kubernetes:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretmavengpgprivatekeypassphrase_5FA7874D: Refreshing state... [id=cdktf-provider-kubernetes:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretnugetapikey_3AFDBD97: Refreshing state... [id=cdktf-provider-kubernetes:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secrettwinepassword_35F66B64: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_PASSWORD]
github_branch_protection.repos_cdktfproviderkubernetes_mainprotection_98A1BD1D: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0Nzg=]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretmavenusername_3569950A: Refreshing state... [id=cdktf-provider-kubernetes:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretmavenstagingprofileid_248C2B94: Refreshing state... [id=cdktf-provider-kubernetes:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretghtoken_CAFEC39F: Refreshing state... [id=cdktf-provider-kubernetes:GH_TOKEN]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretmavengpgprivatekey_439956B6: Refreshing state... [id=cdktf-provider-kubernetes:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secrettwineusername_ED14A2E5: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_USERNAME]
github_issue_label.repos_cdktfproviderkubernetes_automergelabel_1FA4EB21: Refreshing state... [id=cdktf-provider-kubernetes:automerge]
github_issue_label.repos_cdktfprovidernull_automergelabel_EAE50ED1: Refreshing state... [id=cdktf-provider-null:automerge]
github_actions_secret.repos_cdktfprovidernull_repo_secrettwineusername_4BB0B052: Refreshing state... [id=cdktf-provider-null:TWINE_USERNAME]
github_actions_secret.repos_cdktfprovidernull_repo_secrettwinepassword_3CD8CD41: Refreshing state... [id=cdktf-provider-null:TWINE_PASSWORD]
github_actions_secret.repos_cdktfprovidernull_repo_secretghtoken_7C4A936B: Refreshing state... [id=cdktf-provider-null:GH_TOKEN]
github_actions_secret.repos_cdktfprovidernull_repo_secretmavenpassword_C4473759: Refreshing state... [id=cdktf-provider-null:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfprovidernull_repo_secretmavenstagingprofileid_B6129E18: Refreshing state... [id=cdktf-provider-null:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfprovidernull_repo_secretnpmtoken_298712D1: Refreshing state... [id=cdktf-provider-null:NPM_TOKEN]
github_actions_secret.repos_cdktfprovidernull_repo_secretnugetapikey_DC71C82B: Refreshing state... [id=cdktf-provider-null:NUGET_API_KEY]
github_actions_secret.repos_cdktfprovidernull_repo_secretmavengpgprivatekeypassphrase_C0157038: Refreshing state... [id=cdktf-provider-null:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfprovidernull_repo_secretmavengpgprivatekey_296F5999: Refreshing state... [id=cdktf-provider-null:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfprovidernull_repo_secretmavenusername_54BA77A9: Refreshing state... [id=cdktf-provider-null:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderazurerm_repo_secrettwinepassword_56930980: Refreshing state... [id=cdktf-provider-azurerm:TWINE_PASSWORD]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretmavengpgprivatekey_471F3A12: Refreshing state... [id=cdktf-provider-azurerm:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderazurerm_repo_secrettwineusername_AFACB80D: Refreshing state... [id=cdktf-provider-azurerm:TWINE_USERNAME]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretmavengpgprivatekeypassphrase_A589C635: Refreshing state... [id=cdktf-provider-azurerm:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretmavenstagingprofileid_4537E488: Refreshing state... [id=cdktf-provider-azurerm:MAVEN_STAGING_PROFILE_ID]
github_branch_protection.repos_cdktfprovidernull_mainprotection_B3BB4873: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzQ=]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretnpmtoken_FEB5068F: Refreshing state... [id=cdktf-provider-azurerm:NPM_TOKEN]
github_issue_label.repos_cdktfproviderazurerm_automergelabel_9D468D52: Refreshing state... [id=cdktf-provider-azurerm:automerge]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretghtoken_BD7C2F62: Refreshing state... [id=cdktf-provider-azurerm:GH_TOKEN]
github_branch_protection.repos_cdktfproviderazurerm_mainprotection_C1C7E36E: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODI=]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretmavenusername_814A90C7: Refreshing state... [id=cdktf-provider-azurerm:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretnugetapikey_399523C2: Refreshing state... [id=cdktf-provider-azurerm:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretmavenpassword_5B319FA8: Refreshing state... [id=cdktf-provider-azurerm:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretmavenusername_1FB8DD9C: Refreshing state... [id=cdktf-provider-cloudinit:MAVEN_USERNAME]
github_branch_protection.repos_cdktfprovidercloudinit_mainprotection_22F8B7FC: Refreshing state... [id=BPR_kwDOGR9aGs4BWiI7]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretmavengpgprivatekeypassphrase_9885DB69: Refreshing state... [id=cdktf-provider-cloudinit:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretghtoken_16D4D489: Refreshing state... [id=cdktf-provider-cloudinit:GH_TOKEN]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretmavengpgprivatekey_421E0DDB: Refreshing state... [id=cdktf-provider-cloudinit:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretmavenstagingprofileid_0EF608B6: Refreshing state... [id=cdktf-provider-cloudinit:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretnugetapikey_26277B85: Refreshing state... [id=cdktf-provider-cloudinit:NUGET_API_KEY]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secrettwinepassword_89266796: Refreshing state... [id=cdktf-provider-cloudinit:TWINE_PASSWORD]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretnpmtoken_5760A604: Refreshing state... [id=cdktf-provider-cloudinit:NPM_TOKEN]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secrettwineusername_164AD03B: Refreshing state... [id=cdktf-provider-cloudinit:TWINE_USERNAME]
github_issue_label.repos_cdktfprovidercloudinit_automergelabel_1CEE9EB2: Refreshing state... [id=cdktf-provider-cloudinit:automerge]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretmavenpassword_C7609DFA: Refreshing state... [id=cdktf-provider-cloudinit:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretnpmtoken_0106184D: Refreshing state... [id=cdktf-provider-datadog:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretmavenpassword_31006FC4: Refreshing state... [id=cdktf-provider-datadog:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretmavenusername_417CB76E: Refreshing state... [id=cdktf-provider-datadog:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretmavengpgprivatekey_4A9EE2AA: Refreshing state... [id=cdktf-provider-datadog:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderdatadog_repo_secrettwineusername_33DA90FF: Refreshing state... [id=cdktf-provider-datadog:TWINE_USERNAME]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretmavenstagingprofileid_AFC517AE: Refreshing state... [id=cdktf-provider-datadog:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretnugetapikey_626FE559: Refreshing state... [id=cdktf-provider-datadog:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretmavengpgprivatekeypassphrase_A8C3B699: Refreshing state... [id=cdktf-provider-datadog:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_branch_protection.repos_cdktfproviderdatadog_mainprotection_BEF61ED6: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODU=]
github_issue_label.repos_cdktfproviderdatadog_automergelabel_EBE4A0F2: Refreshing state... [id=cdktf-provider-datadog:automerge]
github_actions_secret.repos_cdktfproviderdatadog_repo_secrettwinepassword_69B75D38: Refreshing state... [id=cdktf-provider-datadog:TWINE_PASSWORD]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretghtoken_79DAE67B: Refreshing state... [id=cdktf-provider-datadog:GH_TOKEN]
github_team_repository.repos_cdktfproviderkubernetes_managingteam_E627D265: Refreshing state... [id=3949435:cdktf-provider-kubernetes]
github_team_repository.repos_cdktfproviderproject_managingteam_86F83671: Refreshing state... [id=3949435:cdktf-provider-project]
github_team_repository.repos_cdktfproviderarchive_managingteam_9F25FC7B: Refreshing state... [id=3949435:cdktf-provider-archive]
github_team_repository.repos_cdktfproviderdatadog_managingteam_455152F1: Refreshing state... [id=3949435:cdktf-provider-datadog]
github_team_repository.repos_cdktfprovidernull_managingteam_900A83BC: Refreshing state... [id=3949435:cdktf-provider-null]
github_team_repository.repos_cdktfprovidercloudinit_managingteam_8459E4BF: Refreshing state... [id=3949435:cdktf-provider-cloudinit]
github_team_repository.repos_cdktfproviderlocal_managingteam_0280CE60: Refreshing state... [id=3949435:cdktf-provider-local]
github_team_repository.repos_cdktfprovidergoogle_managingteam_9604098C: Refreshing state... [id=3949435:cdktf-provider-google]
github_team_repository.repos_cdktfproviderazurerm_managingteam_C1D890C2: Refreshing state... [id=3949435:cdktf-provider-azurerm]
github_branch_protection.repos_cdktfproviderrandom_mainprotection_A087F18D: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzU=]
github_actions_secret.repos_cdktfproviderrandom_repo_secretnpmtoken_EB9E9D15: Refreshing state... [id=cdktf-provider-random:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderrandom_repo_secrettwineusername_8B3D5E1D: Refreshing state... [id=cdktf-provider-random:TWINE_USERNAME]
github_actions_secret.repos_cdktfproviderrandom_repo_secrettwinepassword_D1D2F338: Refreshing state... [id=cdktf-provider-random:TWINE_PASSWORD]
github_actions_secret.repos_cdktfproviderrandom_repo_secretmavenstagingprofileid_902F675E: Refreshing state... [id=cdktf-provider-random:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderrandom_repo_secretmavengpgprivatekey_4F3BF592: Refreshing state... [id=cdktf-provider-random:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderrandom_repo_secretmavengpgprivatekeypassphrase_EAE13F98: Refreshing state... [id=cdktf-provider-random:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderrandom_repo_secretnugetapikey_08898A3C: Refreshing state... [id=cdktf-provider-random:NUGET_API_KEY]
github_issue_label.repos_cdktfproviderrandom_automergelabel_94219122: Refreshing state... [id=cdktf-provider-random:automerge]
github_actions_secret.repos_cdktfproviderrandom_repo_secretmavenusername_6DD2B472: Refreshing state... [id=cdktf-provider-random:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderrandom_repo_secretmavenpassword_60CAFD38: Refreshing state... [id=cdktf-provider-random:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderrandom_repo_secretghtoken_BF621699: Refreshing state... [id=cdktf-provider-random:GH_TOKEN]
github_team_repository.repos_cdktfproviderrandom_managingteam_94F669F5: Refreshing state... [id=3949435:cdktf-provider-random]
github_actions_secret.repos_cdktfproviderdocker_repo_secretmavenpassword_078D78B7: Refreshing state... [id=cdktf-provider-docker:MAVEN_PASSWORD]
github_team_repository.repos_cdktfproviderdocker_managingteam_F33627F0: Refreshing state... [id=3949435:cdktf-provider-docker]
github_actions_secret.repos_cdktfproviderdocker_repo_secretnugetapikey_A9805D12: Refreshing state... [id=cdktf-provider-docker:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderdocker_repo_secretmavenusername_9BCF44A1: Refreshing state... [id=cdktf-provider-docker:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderdocker_repo_secretmavengpgprivatekey_BA6F5E6A: Refreshing state... [id=cdktf-provider-docker:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderdocker_repo_secretnpmtoken_3291CA83: Refreshing state... [id=cdktf-provider-docker:NPM_TOKEN]
github_branch_protection.repos_cdktfproviderdocker_mainprotection_BFFE8D77: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODM=]
github_actions_secret.repos_cdktfproviderdocker_repo_secretmavengpgprivatekeypassphrase_D001A76D: Refreshing state... [id=cdktf-provider-docker:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderdocker_repo_secretmavenstagingprofileid_82131E11: Refreshing state... [id=cdktf-provider-docker:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderdocker_repo_secretghtoken_F0BE8962: Refreshing state... [id=cdktf-provider-docker:GH_TOKEN]
github_actions_secret.repos_cdktfproviderdocker_repo_secrettwineusername_C6A649BD: Refreshing state... [id=cdktf-provider-docker:TWINE_USERNAME]
github_issue_label.repos_cdktfproviderdocker_automergelabel_70197107: Refreshing state... [id=cdktf-provider-docker:automerge]
github_actions_secret.repos_cdktfproviderdocker_repo_secrettwinepassword_9FA7C132: Refreshing state... [id=cdktf-provider-docker:TWINE_PASSWORD]
github_actions_secret.repos_cdktfproviderazuread_repo_secrettwineusername_A6332DDB: Refreshing state... [id=cdktf-provider-azuread:TWINE_USERNAME]
github_issue_label.repos_cdktfproviderazuread_automergelabel_08BC2A82: Refreshing state... [id=cdktf-provider-azuread:automerge]
github_actions_secret.repos_cdktfproviderazuread_repo_secretghtoken_9F72F2BC: Refreshing state... [id=cdktf-provider-azuread:GH_TOKEN]
github_actions_secret.repos_cdktfproviderazuread_repo_secrettwinepassword_A2505DAF: Refreshing state... [id=cdktf-provider-azuread:TWINE_PASSWORD]
github_branch_protection.repos_cdktfproviderazuread_mainprotection_F5F1D327: Refreshing state... [id=BPR_kwDOGGjeT84BUxhr]
github_actions_secret.repos_cdktfproviderazuread_repo_secretnpmtoken_9741769E: Refreshing state... [id=cdktf-provider-azuread:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderazuread_repo_secretmavenusername_F1D7EADB: Refreshing state... [id=cdktf-provider-azuread:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderazuread_repo_secretnugetapikey_923C4CA4: Refreshing state... [id=cdktf-provider-azuread:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderazuread_repo_secretmavengpgprivatekeypassphrase_BBB084AC: Refreshing state... [id=cdktf-provider-azuread:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_team_repository.repos_cdktfproviderazuread_managingteam_0135A009: Refreshing state... [id=3949435:cdktf-provider-azuread]
github_actions_secret.repos_cdktfproviderazuread_repo_secretmavengpgprivatekey_533FE21D: Refreshing state... [id=cdktf-provider-azuread:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderazuread_repo_secretmavenpassword_09A80D59: Refreshing state... [id=cdktf-provider-azuread:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderazuread_repo_secretmavenstagingprofileid_C652BC4B: Refreshing state... [id=cdktf-provider-azuread:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderexternal_repo_secretmavenstagingprofileid_69373C76: Refreshing state... [id=cdktf-provider-external:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderexternal_repo_secretmavengpgprivatekey_5EFE7282: Refreshing state... [id=cdktf-provider-external:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderexternal_repo_secretnpmtoken_9E671E6B: Refreshing state... [id=cdktf-provider-external:NPM_TOKEN]
github_team_repository.repos_cdktfproviderexternal_managingteam_9DD6F017: Refreshing state... [id=3949435:cdktf-provider-external]
github_actions_secret.repos_cdktfproviderexternal_repo_secrettwineusername_9A179303: Refreshing state... [id=cdktf-provider-external:TWINE_USERNAME]
github_actions_secret.repos_cdktfproviderexternal_repo_secrettwinepassword_FBA9E7DA: Refreshing state... [id=cdktf-provider-external:TWINE_PASSWORD]
github_branch_protection.repos_cdktfproviderexternal_mainprotection_A8EFF040: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODY=]
github_actions_secret.repos_cdktfproviderexternal_repo_secretmavenpassword_514CA805: Refreshing state... [id=cdktf-provider-external:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderexternal_repo_secretghtoken_5D42DDE5: Refreshing state... [id=cdktf-provider-external:GH_TOKEN]
github_issue_label.repos_cdktfproviderexternal_automergelabel_88E85FD0: Refreshing state... [id=cdktf-provider-external:automerge]
github_actions_secret.repos_cdktfproviderexternal_repo_secretmavenusername_DCFCE305: Refreshing state... [id=cdktf-provider-external:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderexternal_repo_secretmavengpgprivatekeypassphrase_945756E6: Refreshing state... [id=cdktf-provider-external:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderexternal_repo_secretnugetapikey_803FF61F: Refreshing state... [id=cdktf-provider-external:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secrettwineusername_7C8BAF73: Refreshing state... [id=cdktf-provider-pagerduty:TWINE_USERNAME]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretmavenstagingprofileid_31A2C6C1: Refreshing state... [id=cdktf-provider-pagerduty:MAVEN_STAGING_PROFILE_ID]
github_issue_label.repos_cdktfproviderpagerduty_automergelabel_C6025DF6: Refreshing state... [id=cdktf-provider-pagerduty:automerge]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretghtoken_E4C87873: Refreshing state... [id=cdktf-provider-pagerduty:GH_TOKEN]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secrettwinepassword_E227B318: Refreshing state... [id=cdktf-provider-pagerduty:TWINE_PASSWORD]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretmavengpgprivatekey_2DAD8646: Refreshing state... [id=cdktf-provider-pagerduty:MAVEN_GPG_PRIVATE_KEY]
github_team_repository.repos_cdktfproviderpagerduty_managingteam_26C4AF5F: Refreshing state... [id=3949435:cdktf-provider-pagerduty]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretmavengpgprivatekeypassphrase_1B038222: Refreshing state... [id=cdktf-provider-pagerduty:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_branch_protection.repos_cdktfproviderpagerduty_mainprotection_18096071: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA2OTA=]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretmavenpassword_799348D7: Refreshing state... [id=cdktf-provider-pagerduty:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretmavenusername_C6E69A4C: Refreshing state... [id=cdktf-provider-pagerduty:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretnpmtoken_5ADAEEF5: Refreshing state... [id=cdktf-provider-pagerduty:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretnugetapikey_59B61229: Refreshing state... [id=cdktf-provider-pagerduty:NUGET_API_KEY]
github_actions_secret.repos_cdktfrepositorymanager_repo_secretghcommenttoken_58A9B9E8: Refreshing state... [id=cdktf-repository-manager:GH_COMMENT_TOKEN]
github_actions_secret.repos_cdktfrepositorymanager_repo_secrettfcloudtoken_F5D4A22D: Refreshing state... [id=cdktf-repository-manager:TF_CLOUD_TOKEN]
github_issue_label.repos_cdktfrepositorymanager_automergelabel_67A6BDF7: Refreshing state... [id=cdktf-repository-manager:automerge]
github_team_repository.repos_cdktfrepositorymanager_managingteam_31E92624: Refreshing state... [id=3949435:cdktf-repository-manager]
github_branch_protection.repos_cdktfprovideraws_mainprotection_B7F72919: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODE=]
github_actions_secret.repos_cdktfprovideraws_repo_secrettwineusername_BE9CD041: Refreshing state... [id=cdktf-provider-aws:TWINE_USERNAME]
github_actions_secret.repos_cdktfprovideraws_repo_secretghtoken_8F2F704A: Refreshing state... [id=cdktf-provider-aws:GH_TOKEN]
github_actions_secret.repos_cdktfprovideraws_repo_secretmavengpgprivatekeypassphrase_A18AEF45: Refreshing state... [id=cdktf-provider-aws:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfprovideraws_repo_secretmavenpassword_F3C3F5FC: Refreshing state... [id=cdktf-provider-aws:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfprovideraws_repo_secretmavenstagingprofileid_04204128: Refreshing state... [id=cdktf-provider-aws:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfprovideraws_repo_secretmavenusername_3AF9367E: Refreshing state... [id=cdktf-provider-aws:MAVEN_USERNAME]
github_team_repository.repos_cdktfprovideraws_managingteam_FC9AAFD0: Refreshing state... [id=3949435:cdktf-provider-aws]
github_actions_secret.repos_cdktfprovideraws_repo_secretnpmtoken_E55DA3E1: Refreshing state... [id=cdktf-provider-aws:NPM_TOKEN]
github_actions_secret.repos_cdktfprovideraws_repo_secrettwinepassword_412DB927: Refreshing state... [id=cdktf-provider-aws:TWINE_PASSWORD]
github_issue_label.repos_cdktfprovideraws_automergelabel_303B185E: Refreshing state... [id=cdktf-provider-aws:automerge]
github_actions_secret.repos_cdktfprovideraws_repo_secretmavengpgprivatekey_F2F1BC5C: Refreshing state... [id=cdktf-provider-aws:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfprovideraws_repo_secretnugetapikey_1D701175: Refreshing state... [id=cdktf-provider-aws:NUGET_API_KEY]
github_actions_secret.repos_cdktfprovidergithub_repo_secretmavenpassword_5A029ABB: Refreshing state... [id=cdktf-provider-github:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfprovidergithub_repo_secrettwineusername_9AE478B0: Refreshing state... [id=cdktf-provider-github:TWINE_USERNAME]
github_actions_secret.repos_cdktfprovidergithub_repo_secretmavenstagingprofileid_52590AFD: Refreshing state... [id=cdktf-provider-github:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfprovidergithub_repo_secretnpmtoken_241DA344: Refreshing state... [id=cdktf-provider-github:NPM_TOKEN]
github_actions_secret.repos_cdktfprovidergithub_repo_secretmavengpgprivatekeypassphrase_24B3C139: Refreshing state... [id=cdktf-provider-github:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfprovidergithub_repo_secretnugetapikey_B679961E: Refreshing state... [id=cdktf-provider-github:NUGET_API_KEY]
github_branch_protection.repos_cdktfprovidergithub_mainprotection_D33DAB1E: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzY=]
github_actions_secret.repos_cdktfprovidergithub_repo_secretghtoken_EA7D4EA6: Refreshing state... [id=cdktf-provider-github:GH_TOKEN]
github_actions_secret.repos_cdktfprovidergithub_repo_secrettwinepassword_7DE22D13: Refreshing state... [id=cdktf-provider-github:TWINE_PASSWORD]
github_issue_label.repos_cdktfprovidergithub_automergelabel_CB4CF729: Refreshing state... [id=cdktf-provider-github:automerge]
github_team_repository.repos_cdktfprovidergithub_managingteam_DD2D4282: Refreshing state... [id=3949435:cdktf-provider-github]
github_actions_secret.repos_cdktfprovidergithub_repo_secretmavenusername_7EB8800A: Refreshing state... [id=cdktf-provider-github:MAVEN_USERNAME]
github_actions_secret.repos_cdktfprovidertls_repo_secretnpmtoken_867611E6: Refreshing state... [id=cdktf-provider-tls:NPM_TOKEN]
github_actions_secret.repos_cdktfprovidertls_repo_secretmavengpgprivatekey_ACD181DD: Refreshing state... [id=cdktf-provider-tls:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfprovidertls_repo_secretnugetapikey_412325A9: Refreshing state... [id=cdktf-provider-tls:NUGET_API_KEY]
github_actions_secret.repos_cdktfprovidergithub_repo_secretmavengpgprivatekey_00174A0A: Refreshing state... [id=cdktf-provider-github:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfprovidertls_repo_secrettwineusername_B5394966: Refreshing state... [id=cdktf-provider-tls:TWINE_USERNAME]
github_issue_label.repos_cdktfprovidertls_automergelabel_3111B8C0: Refreshing state... [id=cdktf-provider-tls:automerge]
github_actions_secret.repos_cdktfprovidertls_repo_secretmavenstagingprofileid_9250D638: Refreshing state... [id=cdktf-provider-tls:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfprovidertls_repo_secretmavengpgprivatekeypassphrase_490DD8A9: Refreshing state... [id=cdktf-provider-tls:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_team_repository.repos_cdktfprovidertls_managingteam_B495FE84: Refreshing state... [id=3949435:cdktf-provider-tls]
github_actions_secret.repos_cdktfprovidertls_repo_secretmavenpassword_337EB0FA: Refreshing state... [id=cdktf-provider-tls:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfprovidertls_repo_secrettwinepassword_DECFDEB9: Refreshing state... [id=cdktf-provider-tls:TWINE_PASSWORD]
github_actions_secret.repos_cdktfprovidertls_repo_secretmavenusername_0D38F518: Refreshing state... [id=cdktf-provider-tls:MAVEN_USERNAME]
github_branch_protection.repos_cdktfprovidertls_mainprotection_B0EFA7F1: Refreshing state... [id=BPR_kwDOGR5adc4BWhWt]
github_actions_secret.repos_cdktfprovidertls_repo_secretghtoken_98CDF4F0: Refreshing state... [id=cdktf-provider-tls:GH_TOKEN]
github_actions_secret.repos_cdktfproviderhelm_repo_secretghtoken_5CAEF33E: Refreshing state... [id=cdktf-provider-helm:GH_TOKEN]
github_branch_protection.repos_cdktfproviderhelm_mainprotection_DD165CB9: Refreshing state... [id=BPR_kwDOGU2VS84BXA6_]
github_actions_secret.repos_cdktfproviderhelm_repo_secrettwineusername_715D77D4: Refreshing state... [id=cdktf-provider-helm:TWINE_USERNAME]
github_actions_secret.repos_cdktfproviderhelm_repo_secretnpmtoken_2AF19A38: Refreshing state... [id=cdktf-provider-helm:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderhelm_repo_secretmavenpassword_9FC1077F: Refreshing state... [id=cdktf-provider-helm:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderhelm_repo_secretmavenusername_9DDCAD6E: Refreshing state... [id=cdktf-provider-helm:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderhelm_repo_secrettwinepassword_AE46BBD1: Refreshing state... [id=cdktf-provider-helm:TWINE_PASSWORD]
github_issue_label.repos_cdktfproviderhelm_automergelabel_F8D0E361: Refreshing state... [id=cdktf-provider-helm:automerge]
github_actions_secret.repos_cdktfproviderhelm_repo_secretmavenstagingprofileid_3B8E68F8: Refreshing state... [id=cdktf-provider-helm:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderhelm_repo_secretmavengpgprivatekey_1A337527: Refreshing state... [id=cdktf-provider-helm:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderhelm_repo_secretmavengpgprivatekeypassphrase_884BBC5C: Refreshing state... [id=cdktf-provider-helm:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_team_repository.repos_cdktfproviderhelm_managingteam_C2C08744: Refreshing state... [id=3949435:cdktf-provider-helm]
github_actions_secret.repos_cdktfproviderhelm_repo_secretnugetapikey_8B2B96A8: Refreshing state... [id=cdktf-provider-helm:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secrettwineusername_60095520: Refreshing state... [id=cdktf-provider-postgresql:TWINE_USERNAME]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretmavengpgprivatekey_D0967044: Refreshing state... [id=cdktf-provider-postgresql:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretnugetapikey_BD7007D3: Refreshing state... [id=cdktf-provider-postgresql:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secrettwinepassword_7F63E4F3: Refreshing state... [id=cdktf-provider-postgresql:TWINE_PASSWORD]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretmavenusername_FAD21036: Refreshing state... [id=cdktf-provider-postgresql:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretmavenstagingprofileid_AC87200E: Refreshing state... [id=cdktf-provider-postgresql:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretmavengpgprivatekeypassphrase_8FBBA023: Refreshing state... [id=cdktf-provider-postgresql:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_branch_protection.repos_cdktfproviderpostgresql_mainprotection_BE8DB09C: Refreshing state... [id=BPR_kwDOGR9aB84BWiJK]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretmavenpassword_87D10804: Refreshing state... [id=cdktf-provider-postgresql:MAVEN_PASSWORD]
github_issue_label.repos_cdktfproviderpostgresql_automergelabel_DD5AD89C: Refreshing state... [id=cdktf-provider-postgresql:automerge]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretghtoken_35AD4AD8: Refreshing state... [id=cdktf-provider-postgresql:GH_TOKEN]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretnpmtoken_C48EAD8D: Refreshing state... [id=cdktf-provider-postgresql:NPM_TOKEN]
github_team_repository.repos_cdktfproviderpostgresql_managingteam_C34F4034: Refreshing state... [id=3949435:cdktf-provider-postgresql]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_team_repository.repos_cdktfproviderexternal_managingteam_9DD6F017 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderexternal_managingteam_9DD6F017" {
      ~ etag       = "W/\"6a093d2c520e5799eb206be04a6b2a6815ea67406864bdcd5d97483c3be7ea85\"" -> "W/\"5999e97d8c3bb590bc30593dea376e64591b6b10f30d859745dc8806e7674c3a\""
        id         = "3949435:cdktf-provider-external"
        # (3 unchanged attributes hidden)
    }
  # github_branch_protection.repos_cdktfproviderhelm_mainprotection_DD165CB9 has been changed
  ~ resource "github_branch_protection" "repos_cdktfproviderhelm_mainprotection_DD165CB9" {
        id                     = "BPR_kwDOGU2VS84BXA6_"
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.repos_cdktfproviderazurerm_managingteam_C1D890C2 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderazurerm_managingteam_C1D890C2" {
      ~ etag       = "W/\"61a3a8895185dfaf9faa03e8b254522abcab03ae4b86f12643779ac9c892d347\"" -> "W/\"74eb7078aeb01b17c254e0cc9a70dd2242b0ac2ab9fe67f33e49f897d8e67e2a\""
        id         = "3949435:cdktf-provider-azurerm"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderdatadog_repo_3C8DEE00 has been changed
  ~ resource "github_repository" "repos_cdktfproviderdatadog_repo_3C8DEE00" {
      ~ etag                   = "W/\"cbfaa99d7243860b3e77dfec31f4729a93afcfdff324e058d4dac9e77879805d\"" -> "W/\"41f41f383b18769eb1504c399c00298bcd9e5f7d16a4966f09f2a5d2d68a4bdf\""
        id                     = "cdktf-provider-datadog"
        name                   = "cdktf-provider-datadog"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderpagerduty_repo_0AF36FE3 has been changed
  ~ resource "github_repository" "repos_cdktfproviderpagerduty_repo_0AF36FE3" {
      ~ etag                   = "W/\"c052b8183123dabf275f3e0b00b8f0a33eee9e16195dadac75c9496d112cda83\"" -> "W/\"f937a9c226d9de2f4b6ef220bd2a0eb6df13fd5e62109a8d7e3b16b44e328da4\""
        id                     = "cdktf-provider-pagerduty"
        name                   = "cdktf-provider-pagerduty"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderlocal_repo_4D7B21AD has been changed
  ~ resource "github_repository" "repos_cdktfproviderlocal_repo_4D7B21AD" {
      ~ etag                   = "W/\"df47428aeaaa9884cdaa0f59dbbf62675f076329f831bb5e9202813eb797d00f\"" -> "W/\"4d98ea9e4bb3f4c25be4d12ed011d46395a66779d29f497d48fce0c9d1993816\""
        id                     = "cdktf-provider-local"
        name                   = "cdktf-provider-local"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidertls_managingteam_B495FE84 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidertls_managingteam_B495FE84" {
      ~ etag       = "W/\"ad0d2ad1e6beecfb8b9adad7f182b1a405c27cd601f934d7f276cf84ee3033df\"" -> "W/\"aba73f21e2b577bb5c3855a250be7f06a5648245d882657099bd6dad68d16bde\""
        id         = "3949435:cdktf-provider-tls"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderazuread_managingteam_0135A009 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderazuread_managingteam_0135A009" {
      ~ etag       = "W/\"52f354fb2a0317b6d444093d1f68bbef474778a335914dfad34c0146f527abe5\"" -> "W/\"10b130baebf103333cb148e8f6a012ed0aa810e179da0103e52b5dfd74e224d3\""
        id         = "3949435:cdktf-provider-azuread"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidernull_managingteam_900A83BC has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidernull_managingteam_900A83BC" {
      ~ etag       = "W/\"29ee260867304722a76e6b92a66a98a3f671c23bafd103d69385b31326ee955e\"" -> "W/\"9d4c1c6610be99f07e1bd094832713328a0b0fec8cac08d9430cca91c83440cc\""
        id         = "3949435:cdktf-provider-null"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovideraws_managingteam_FC9AAFD0 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideraws_managingteam_FC9AAFD0" {
      ~ etag       = "W/\"c36eba6b6a3e0858002976edb36931aad3a21c4047d92b18d66665be69465615\"" -> "W/\"7dbd2ac9047dfea31f90660e36dafe4cf1f8678f3b3340bee440e67729adf92c\""
        id         = "3949435:cdktf-provider-aws"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidercloudinit_repo_4E4D12FF has been changed
  ~ resource "github_repository" "repos_cdktfprovidercloudinit_repo_4E4D12FF" {
      ~ etag                   = "W/\"4c77c22764786fd2c2834b0b4b4bb4256ced01c58721d5510c1a28d1c2e79c92\"" -> "W/\"bd3e7bb35f2b3858e45fde370ca4e33866f5b403e1d8ff65dcc077ed1948c657\""
        id                     = "cdktf-provider-cloudinit"
        name                   = "cdktf-provider-cloudinit"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderpostgresql_managingteam_C34F4034 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderpostgresql_managingteam_C34F4034" {
      ~ etag       = "W/\"d18503041a2eb3bad7df6d142839f1080c2118c4340985338ff00272a610265a\"" -> "W/\"3451ad0e816603a7c04a5a7b30acf83bd3853837596c920f234d19eb35d2402e\""
        id         = "3949435:cdktf-provider-postgresql"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderlocal_managingteam_0280CE60 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderlocal_managingteam_0280CE60" {
      ~ etag       = "W/\"6c8b7fb29bbc672cf26a667a79cbfb9f6da998ac775080665402370d446177c9\"" -> "W/\"12852d95f540310d23fbdd4d0eeb4bd2331a1b6d17cb2da39abaaa826750333b\""
        id         = "3949435:cdktf-provider-local"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderhelm_repo_E5C9B6C8 has been changed
  ~ resource "github_repository" "repos_cdktfproviderhelm_repo_E5C9B6C8" {
      ~ etag                   = "W/\"8da4229d88307ec46c09e74120ace56d5d9b4baeb3503dfb9fe89676762ffd8f\"" -> "W/\"c54d01d594c069e4d72dcb45680bca4c8639aa9bb09e65e3c773321ce9302312\""
        id                     = "cdktf-provider-helm"
        name                   = "cdktf-provider-helm"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdatadog_managingteam_455152F1 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdatadog_managingteam_455152F1" {
      ~ etag       = "W/\"b00565091119d5cc254ef0ecb53dc1d2c2ca591cf1e4fd4a1304cf1a7d681bae\"" -> "W/\"43add4371e6b46c85a467d72b3adcb946064bb0daa8c947343953924f8b09176\""
        id         = "3949435:cdktf-provider-datadog"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfrepositorymanager_managingteam_31E92624 has been changed
  ~ resource "github_team_repository" "repos_cdktfrepositorymanager_managingteam_31E92624" {
      ~ etag       = "W/\"3b3ac4811d262b8fb0e40d266302d08dd91a2992add07cc29b17ab7bc12e099f\"" -> "W/\"6441c40c8d28cd5214af0de6b02e999cf34befd3bf69cee7d71821cc0695c509\""
        id         = "3949435:cdktf-repository-manager"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderpostgresql_repo_9CD37AD7 has been changed
  ~ resource "github_repository" "repos_cdktfproviderpostgresql_repo_9CD37AD7" {
      ~ etag                   = "W/\"c1850a2969facc152a1d6135de32a3bf04ec2121c6ea7b77ed236eca3787497f\"" -> "W/\"481f6c81d6fff76370f03bbea43153db724930581f8c0e791e9137814eba0ea1\""
        id                     = "cdktf-provider-postgresql"
        name                   = "cdktf-provider-postgresql"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdocker_managingteam_F33627F0 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdocker_managingteam_F33627F0" {
      ~ etag       = "W/\"5676b77f51354680f08f4db8246763bd67700aca22d72636db2c13379ebbfda0\"" -> "W/\"1ff50d1fb76fcc2b8eb3b27dd56483efa9321c93e10844188ac2aac03259deba\""
        id         = "3949435:cdktf-provider-docker"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderrandom_managingteam_94F669F5 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderrandom_managingteam_94F669F5" {
      ~ etag       = "W/\"9b971d75ea53ec03ba2cb04eea0651d0f27e4b06092a37de3232ad766529f189\"" -> "W/\"4e5a3af7314f42eeb981c29ae725746dcbb2a14fe3066435260b715abdc6061a\""
        id         = "3949435:cdktf-provider-random"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderarchive_repo_F28A4A49 has been changed
  ~ resource "github_repository" "repos_cdktfproviderarchive_repo_F28A4A49" {
      ~ etag                   = "W/\"8ee489fbbc8407086b60bf77b7d8a75a1c0060e1e9ef731f21ffefdf76b17991\"" -> "W/\"bdbc51c90bffde2ecd9cf86725f0b7fc99bd4c70634a4b934c3c7843a8f3cbc8\""
        id                     = "cdktf-provider-archive"
        name                   = "cdktf-provider-archive"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidergithub_repo_66B8E54A has been changed
  ~ resource "github_repository" "repos_cdktfprovidergithub_repo_66B8E54A" {
      ~ etag                   = "W/\"631e86386f6911e8310880857fc85e6856cd249cedde2862fc9475eae40166f8\"" -> "W/\"5e89305366e8bfcdcaa1ecbb08d19bb92b99da3abdbcd6b04aec6d863a5e5795\""
        id                     = "cdktf-provider-github"
        name                   = "cdktf-provider-github"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderproject_managingteam_86F83671 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderproject_managingteam_86F83671" {
      ~ etag       = "W/\"b29b3d9bd38ba7c07bcad44954f71b499707454adcc6667a349f9479cc7807e7\"" -> "W/\"683da9bff34445b43cb2225afd647a0b1294a53879972de9924f772aa77261dc\""
        id         = "3949435:cdktf-provider-project"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderkubernetes_repo_D69C3A79 has been changed
  ~ resource "github_repository" "repos_cdktfproviderkubernetes_repo_D69C3A79" {
      ~ etag                   = "W/\"9a0e3f9a807124220db057a1a5be9f40b67b93687059dfebc3d2abd89f307254\"" -> "W/\"9e14c8dca624cf4345cb1cbda73a0cc1522d3332ad575123a556f9a2859f3991\""
        id                     = "cdktf-provider-kubernetes"
        name                   = "cdktf-provider-kubernetes"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderhelm_managingteam_C2C08744 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderhelm_managingteam_C2C08744" {
      ~ etag       = "W/\"3bf713e552a83c6d632486552861c747e7b3acb8763eecfe08a26a641543004b\"" -> "W/\"55d11e76649f04f4c1a64bf0d970e5931fd997bdc43147145b6aa39affbdec3e\""
        id         = "3949435:cdktf-provider-helm"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidergoogle_repo_3D7769E0 has been changed
  ~ resource "github_repository" "repos_cdktfprovidergoogle_repo_3D7769E0" {
      ~ etag                   = "W/\"4712c012c8f146e5b6dee9c398c52f68bad3d692800f7e74ca53c1fbf2da5a50\"" -> "W/\"4bf87f7a8a6f59517c364b62c45e7201b393f1cee60646621a08f883ce63b25b\""
        id                     = "cdktf-provider-google"
        name                   = "cdktf-provider-google"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderpagerduty_managingteam_26C4AF5F has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderpagerduty_managingteam_26C4AF5F" {
      ~ etag       = "W/\"228a9be04f269ce867cb3159d2591aca79ef652a7b50c59eae9ff6f8e84b3c10\"" -> "W/\"094171bdb4a769f29650ffab15baaf0e9b04462b29b10a03697b1b6364c8d53c\""
        id         = "3949435:cdktf-provider-pagerduty"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderazuread_repo_A398ECE6 has been changed
  ~ resource "github_repository" "repos_cdktfproviderazuread_repo_A398ECE6" {
      ~ etag                   = "W/\"0c21e613b89989cde3b8557d5a2a5845686e48da636c1937031dc248a6d843a4\"" -> "W/\"fa2370428634fad65b2e9a86694d44ff29b65acdd05c8bbe297d70ad449e2648\""
        id                     = "cdktf-provider-azuread"
        name                   = "cdktf-provider-azuread"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergithub_managingteam_DD2D4282 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergithub_managingteam_DD2D4282" {
      ~ etag       = "W/\"f926866061ab905444eb9f392732b61439523d42c536c4a642cefb490f8d84b5\"" -> "W/\"d5e8696eb05dcbcf5070b545739f06fa935f4fcb4db186505b52fa2cfdd304d3\""
        id         = "3949435:cdktf-provider-github"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergoogle_managingteam_9604098C has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergoogle_managingteam_9604098C" {
      ~ etag       = "W/\"66ef8c64053b9c7864d26e572664bd07ed4dd0ff6b67380018c036c23e04ae2f\"" -> "W/\"80a1b96c6a1736379f92e37f715d10729ab148608d3c6b6578b5e1cd3d31afe4\""
        id         = "3949435:cdktf-provider-google"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovideraws_repo_55F46B23 has been changed
  ~ resource "github_repository" "repos_cdktfprovideraws_repo_55F46B23" {
      ~ etag                   = "W/\"c59f43f17751fc431dbf5f2d5281640c53c8a71b825f8d03334918ad4cefb56c\"" -> "W/\"dc70fc2f9f19a2d178c30ebfecacb9c21d999e8aa3b87a95a80150ca9da53bc3\""
        id                     = "cdktf-provider-aws"
        name                   = "cdktf-provider-aws"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderdocker_repo_45A47809 has been changed
  ~ resource "github_repository" "repos_cdktfproviderdocker_repo_45A47809" {
      ~ etag                   = "W/\"dc9b3ccea568cca0bf72abcb2db75a43a8b7e7acf3ee04c7ffd1aba11496e959\"" -> "W/\"3d0dd174301ffb8305a97a33a97bd5f192558ed9bbed1bf80cca8aaae6e91c0a\""
        id                     = "cdktf-provider-docker"
        name                   = "cdktf-provider-docker"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfrepositorymanager_repo_9D19EE52 has been changed
  ~ resource "github_repository" "repos_cdktfrepositorymanager_repo_9D19EE52" {
      ~ etag                   = "W/\"9afd4001d619b99b4b92d5a7f03fbc9517debfe49a9d4d6f5a4c84027e19dd8e\"" -> "W/\"87853eb179c46b8849b5eaaafbf8b781bc9a763cb02793360a7c56057fdf2f03\""
        id                     = "cdktf-repository-manager"
        name                   = "cdktf-repository-manager"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidernull_repo_8A692B1D has been changed
  ~ resource "github_repository" "repos_cdktfprovidernull_repo_8A692B1D" {
      ~ etag                   = "W/\"ad684dac78da89d3246b53fbb82a6a0bf5679db540d54dd76049e5812986de22\"" -> "W/\"1be26866986da08b5714759291707e5499362a158c3f4f68a4937eaff68c3e3b\""
        id                     = "cdktf-provider-null"
        name                   = "cdktf-provider-null"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderexternal_repo_2177D259 has been changed
  ~ resource "github_repository" "repos_cdktfproviderexternal_repo_2177D259" {
      ~ etag                   = "W/\"b932654fff13d97d675a4632fb4a897bbee4a9b26e916679b9cb3b4c70395178\"" -> "W/\"b8c2633a3ce3b82ad7833a6c2981206ab889f618892d2875a24d64957ff5150f\""
        id                     = "cdktf-provider-external"
        name                   = "cdktf-provider-external"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderazurerm_repo_19E06DC3 has been changed
  ~ resource "github_repository" "repos_cdktfproviderazurerm_repo_19E06DC3" {
      ~ etag                   = "W/\"fc21f478c04fbb02d89b32c16949b6dcff28dfb40bcb5e2e956421e0dacf7923\"" -> "W/\"e689cc6e735cc7485f72e45653e5b682b1c6955372d429212f8c89749d68c994\""
        id                     = "cdktf-provider-azurerm"
        name                   = "cdktf-provider-azurerm"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidertls_repo_E6EAEEBE has been changed
  ~ resource "github_repository" "repos_cdktfprovidertls_repo_E6EAEEBE" {
      ~ etag                   = "W/\"7e0d2c91fcdd94f69e029552b9cff3a71423d72bf514a0e5bd40ad05e2096816\"" -> "W/\"2c218ffba9280495ace776e09dc388b610c8256dcad099b685868a60bca79b5b\""
        id                     = "cdktf-provider-tls"
        name                   = "cdktf-provider-tls"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderarchive_managingteam_9F25FC7B has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderarchive_managingteam_9F25FC7B" {
      ~ etag       = "W/\"afae00c89aa48c7cd25ffef6437bcb61a3a1bba59c7381c97dfdca82cb3a2ecf\"" -> "W/\"c5338671fb2e74f9e06c2587b36c054a884c49ff3739343fb30fe37b9620c30f\""
        id         = "3949435:cdktf-provider-archive"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidercloudinit_managingteam_8459E4BF has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidercloudinit_managingteam_8459E4BF" {
      ~ etag       = "W/\"6c4ac2edbc7be7e4615c5cd2d7cbd496fad87d100b216aa248499d8d6880512e\"" -> "W/\"1f4b05a217d3703567158e0914eb8e83d355105be3963b970acf24bb67138c25\""
        id         = "3949435:cdktf-provider-cloudinit"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderkubernetes_managingteam_E627D265 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderkubernetes_managingteam_E627D265" {
      ~ etag       = "W/\"236dffb68cd84d1011ea75d1a7876a8c3a4fd50e939a857b4b6ee1ad87918e31\"" -> "W/\"4dc8fd30fdc9481744e92355a3214e51d9ce49a784cd66ddc4547b46aa3b6db2\""
        id         = "3949435:cdktf-provider-kubernetes"
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.repos_cdktfprovideropentelekomcloud_repo_secretghtoken_975028D4 will be created
  + resource "github_actions_secret" "repos_cdktfprovideropentelekomcloud_repo_secretghtoken_975028D4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-opentelekomcloud"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovideropentelekomcloud_repo_secretmavengpgprivatekey_BC9936BD will be created
  + resource "github_actions_secret" "repos_cdktfprovideropentelekomcloud_repo_secretmavengpgprivatekey_BC9936BD" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-opentelekomcloud"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovideropentelekomcloud_repo_secretmavengpgprivatekeypassphrase_EB35DD4E will be created
  + resource "github_actions_secret" "repos_cdktfprovideropentelekomcloud_repo_secretmavengpgprivatekeypassphrase_EB35DD4E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-opentelekomcloud"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovideropentelekomcloud_repo_secretmavenpassword_7CABF2C0 will be created
  + resource "github_actions_secret" "repos_cdktfprovideropentelekomcloud_repo_secretmavenpassword_7CABF2C0" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-opentelekomcloud"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovideropentelekomcloud_repo_secretmavenstagingprofileid_0C0DAABC will be created
  + resource "github_actions_secret" "repos_cdktfprovideropentelekomcloud_repo_secretmavenstagingprofileid_0C0DAABC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-opentelekomcloud"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovideropentelekomcloud_repo_secretmavenusername_77E1BF61 will be created
  + resource "github_actions_secret" "repos_cdktfprovideropentelekomcloud_repo_secretmavenusername_77E1BF61" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-opentelekomcloud"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovideropentelekomcloud_repo_secretnpmtoken_EF3D84C6 will be created
  + resource "github_actions_secret" "repos_cdktfprovideropentelekomcloud_repo_secretnpmtoken_EF3D84C6" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-opentelekomcloud"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovideropentelekomcloud_repo_secretnugetapikey_6FDB97C5 will be created
  + resource "github_actions_secret" "repos_cdktfprovideropentelekomcloud_repo_secretnugetapikey_6FDB97C5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-opentelekomcloud"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovideropentelekomcloud_repo_secrettwinepassword_BC6C9608 will be created
  + resource "github_actions_secret" "repos_cdktfprovideropentelekomcloud_repo_secrettwinepassword_BC6C9608" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-opentelekomcloud"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovideropentelekomcloud_repo_secrettwineusername_1F954572 will be created
  + resource "github_actions_secret" "repos_cdktfprovideropentelekomcloud_repo_secrettwineusername_1F954572" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-opentelekomcloud"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.repos_cdktfprovideropentelekomcloud_mainprotection_DD545A85 will be created
  + resource "github_branch_protection" "repos_cdktfprovideropentelekomcloud_mainprotection_DD545A85" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-opentelekomcloud"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
            ]
          + strict   = true
        }
    }

  # github_issue_label.repos_cdktfprovideropentelekomcloud_automergelabel_BAE5E6EC will be created
  + resource "github_issue_label" "repos_cdktfprovideropentelekomcloud_automergelabel_BAE5E6EC" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-opentelekomcloud"
      + url        = (known after apply)
    }

  # github_repository.repos_cdktfprovideropentelekomcloud_repo_8ABA825B will be created
  + resource "github_repository" "repos_cdktfprovideropentelekomcloud_repo_8ABA825B" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Prebuilt Terraform CDK (cdktf) provider for opentelekomcloud."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.tf"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cdktf-provider-opentelekomcloud"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "cdk",
          + "cdktf",
          + "opentelekomcloud",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility             = "public"
    }

  # github_team_repository.repos_cdktfprovideropentelekomcloud_managingteam_85515FC1 will be created
  + resource "github_team_repository" "repos_cdktfprovideropentelekomcloud_managingteam_85515FC1" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-opentelekomcloud"
      + team_id    = "3949435"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ repos_providerRepos_C7679B58 = [
        # (13 unchanged elements hidden)
        "git@github.com:hashicorp/cdktf-provider-null.git",
      + (known after apply),
        "git@github.com:hashicorp/cdktf-provider-pagerduty.git",
        # (3 unchanged elements hidden)
    ]
```

</details>

*Pusher: @ansgarm, Action: `pull_request`, Working Directory: ``, Workflow: `Repository Manager`*